MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472KEHI/mcu.h
/*  Bit definition for GPIO_POERE register  */
#define GPIO_POERE_POUTE07_POS                         (7U)
#define GPIO_POERE_POUTE07                             (0x0080U)
#define GPIO_POERE_POUTE08_POS                         (8U)
#define GPIO_POERE_POUTE08                             (0x0100U)

/*  Bit definition for GPIO_POSRE register  */
#define GPIO_POSRE_POS07_POS                           (7U)
#define GPIO_POSRE_POS07                               (0x0080U)
#define GPIO_POSRE_POS08_POS                           (8U)
#define GPIO_POSRE_POS08                               (0x0100U)

/*  Bit definition for GPIO_PORRE register  */
#define GPIO_PORRE_POR07_POS                           (7U)
#define GPIO_PORRE_POR07                               (0x0080U)
#define GPIO_PORRE_POR08_POS                           (8U)
#define GPIO_PORRE_POR08                               (0x0100U)

/*  Bit definition for GPIO_POTRE register  */
#define GPIO_POTRE_POT07_POS                           (7U)
#define GPIO_POTRE_POT07                               (0x0080U)
#define GPIO_POTRE_POT08_POS                           (8U)
#define GPIO_POTRE_POT08                               (0x0100U)

/*  Bit definition for GPIO_PIDRF register  */
#define GPIO_PIDRF_PIN00_POS                           (0U)
#define GPIO_PIDRF_PIN00                               (0x0001U)
#define GPIO_PIDRF_PIN01_POS                           (1U)
#define GPIO_PIDRF_PIN01                               (0x0002U)
#define GPIO_PIDRF_PIN03_POS                           (3U)
#define GPIO_PIDRF_PIN03                               (0x0008U)
#define GPIO_PIDRF_PIN04_POS                           (4U)
#define GPIO_PIDRF_PIN04                               (0x0010U)
#define GPIO_PIDRF_PIN05_POS                           (5U)
#define GPIO_PIDRF_PIN05                               (0x0020U)
#define GPIO_PIDRF_PIN06_POS                           (6U)
#define GPIO_PIDRF_PIN06                               (0x0040U)
#define GPIO_PIDRF_PIN07_POS                           (7U)
#define GPIO_PIDRF_PIN07                               (0x0080U)

/*  Bit definition for GPIO_PODRF register  */
#define GPIO_PODRF_POUT00_POS                          (0U)
#define GPIO_PODRF_POUT00                              (0x0001U)
#define GPIO_PODRF_POUT01_POS                          (1U)
#define GPIO_PODRF_POUT01                              (0x0002U)
#define GPIO_PODRF_POUT03_POS                          (3U)
#define GPIO_PODRF_POUT03                              (0x0008U)
#define GPIO_PODRF_POUT04_POS                          (4U)
#define GPIO_PODRF_POUT04                              (0x0010U)
#define GPIO_PODRF_POUT05_POS                          (5U)
#define GPIO_PODRF_POUT05                              (0x0020U)
#define GPIO_PODRF_POUT06_POS                          (6U)
#define GPIO_PODRF_POUT06                              (0x0040U)
#define GPIO_PODRF_POUT07_POS                          (7U)
#define GPIO_PODRF_POUT07                              (0x0080U)

/*  Bit definition for GPIO_POERF register  */
#define GPIO_POERF_POUTE00_POS                         (0U)
#define GPIO_POERF_POUTE00                             (0x0001U)
#define GPIO_POERF_POUTE01_POS                         (1U)
#define GPIO_POERF_POUTE01                             (0x0002U)
#define GPIO_POERF_POUTE03_POS                         (3U)
#define GPIO_POERF_POUTE03                             (0x0008U)
#define GPIO_POERF_POUTE04_POS                         (4U)
#define GPIO_POERF_POUTE04                             (0x0010U)
#define GPIO_POERF_POUTE05_POS                         (5U)
#define GPIO_POERF_POUTE05                             (0x0020U)
#define GPIO_POERF_POUTE06_POS                         (6U)
#define GPIO_POERF_POUTE06                             (0x0040U)
#define GPIO_POERF_POUTE07_POS                         (7U)
#define GPIO_POERF_POUTE07                             (0x0080U)

/*  Bit definition for GPIO_POSRF register  */
#define GPIO_POSRF_POS00_POS                           (0U)
#define GPIO_POSRF_POS00                               (0x0001U)
#define GPIO_POSRF_POS01_POS                           (1U)
#define GPIO_POSRF_POS01                               (0x0002U)
#define GPIO_POSRF_POS03_POS                           (3U)
#define GPIO_POSRF_POS03                               (0x0008U)
#define GPIO_POSRF_POS04_POS                           (4U)
#define GPIO_POSRF_POS04                               (0x0010U)
#define GPIO_POSRF_POS05_POS                           (5U)
#define GPIO_POSRF_POS05                               (0x0020U)
#define GPIO_POSRF_POS06_POS                           (6U)
#define GPIO_POSRF_POS06                               (0x0040U)
#define GPIO_POSRF_POS07_POS                           (7U)
#define GPIO_POSRF_POS07                               (0x0080U)

/*  Bit definition for GPIO_PORRF register  */
#define GPIO_PORRF_POR00_POS                           (0U)
#define GPIO_PORRF_POR00                               (0x0001U)
#define GPIO_PORRF_POR01_POS                           (1U)
#define GPIO_PORRF_POR01                               (0x0002U)
#define GPIO_PORRF_POR03_POS                           (3U)
#define GPIO_PORRF_POR03                               (0x0008U)
#define GPIO_PORRF_POR04_POS                           (4U)
#define GPIO_PORRF_POR04                               (0x0010U)
#define GPIO_PORRF_POR05_POS                           (5U)
#define GPIO_PORRF_POR05                               (0x0020U)
#define GPIO_PORRF_POR06_POS                           (6U)
#define GPIO_PORRF_POR06                               (0x0040U)
#define GPIO_PORRF_POR07_POS                           (7U)
#define GPIO_PORRF_POR07                               (0x0080U)

/*  Bit definition for GPIO_POTRF register  */
#define GPIO_POTRF_POT00_POS                           (0U)
#define GPIO_POTRF_POT00                               (0x0001U)
#define GPIO_POTRF_POT01_POS                           (1U)
#define GPIO_POTRF_POT01                               (0x0002U)
#define GPIO_POTRF_POT03_POS                           (3U)
#define GPIO_POTRF_POT03                               (0x0008U)
#define GPIO_POTRF_POT04_POS                           (4U)
#define GPIO_POTRF_POT04                               (0x0010U)
#define GPIO_POTRF_POT05_POS                           (5U)
#define GPIO_POTRF_POT05                               (0x0020U)
#define GPIO_POTRF_POT06_POS                           (6U)
#define GPIO_POTRF_POT06                               (0x0040U)
#define GPIO_POTRF_POT07_POS                           (7U)
#define GPIO_POTRF_POT07                               (0x0080U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x001FU)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)
#define GPIO_PSPCR_SPFE_2                              (0x0004U)
#define GPIO_PSPCR_SPFE_3                              (0x0008U)
#define GPIO_PSPCR_SPFE_4                              (0x0010U)

