MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472KEHI/mcu.h
/*  Bit definition for MPU_SCR register  */
#define MPU_SCR_SMPUBRP_POS                            (0U)
#define MPU_SCR_SMPUBRP                                (0x00000001UL)
#define MPU_SCR_SMPUBWP_POS                            (1U)
#define MPU_SCR_SMPUBWP                                (0x00000002UL)
#define MPU_SCR_SMPUACT_POS                            (2U)
#define MPU_SCR_SMPUACT                                (0x0000000CUL)
#define MPU_SCR_SMPUACT_0                              (0x00000004UL)
#define MPU_SCR_SMPUACT_1                              (0x00000008UL)
#define MPU_SCR_SMPUE_POS                              (7U)
#define MPU_SCR_SMPUE                                  (0x00000080UL)

/*  Bit definition for MPU_FRGE register  */
#define MPU_FRGE_FRG0E_POS                             (0U)
#define MPU_FRGE_FRG0E                                 (0x00000001UL)
#define MPU_FRGE_FRG1E_POS                             (1U)
#define MPU_FRGE_FRG1E                                 (0x00000002UL)
#define MPU_FRGE_FRG2E_POS                             (2U)
#define MPU_FRGE_FRG2E                                 (0x00000004UL)
#define MPU_FRGE_FRG3E_POS                             (3U)
#define MPU_FRGE_FRG3E                                 (0x00000008UL)
#define MPU_FRGE_FRG4E_POS                             (4U)
#define MPU_FRGE_FRG4E                                 (0x00000010UL)
#define MPU_FRGE_FRG5E_POS                             (5U)
#define MPU_FRGE_FRG5E                                 (0x00000020UL)
#define MPU_FRGE_FRG6E_POS                             (6U)
#define MPU_FRGE_FRG6E                                 (0x00000040UL)
#define MPU_FRGE_FRG7E_POS                             (7U)
#define MPU_FRGE_FRG7E                                 (0x00000080UL)

/*  Bit definition for MPU_FRGWP register  */
#define MPU_FRGWP_FRG0WP_POS                           (0U)
#define MPU_FRGWP_FRG0WP                               (0x00000001UL)
#define MPU_FRGWP_FRG1WP_POS                           (1U)
#define MPU_FRGWP_FRG1WP                               (0x00000002UL)
#define MPU_FRGWP_FRG2WP_POS                           (2U)
#define MPU_FRGWP_FRG2WP                               (0x00000004UL)
#define MPU_FRGWP_FRG3WP_POS                           (3U)
#define MPU_FRGWP_FRG3WP                               (0x00000008UL)
#define MPU_FRGWP_FRG4WP_POS                           (4U)
#define MPU_FRGWP_FRG4WP                               (0x00000010UL)
#define MPU_FRGWP_FRG5WP_POS                           (5U)
#define MPU_FRGWP_FRG5WP                               (0x00000020UL)
#define MPU_FRGWP_FRG6WP_POS                           (6U)
#define MPU_FRGWP_FRG6WP                               (0x00000040UL)
#define MPU_FRGWP_FRG7WP_POS                           (7U)
#define MPU_FRGWP_FRG7WP                               (0x00000080UL)

/*  Bit definition for MPU_FRGRP register  */
#define MPU_FRGRP_FRG0RP_POS                           (0U)
#define MPU_FRGRP_FRG0RP                               (0x00000001UL)
#define MPU_FRGRP_FRG1RP_POS                           (1U)
#define MPU_FRGRP_FRG1RP                               (0x00000002UL)
#define MPU_FRGRP_FRG2RP_POS                           (2U)
#define MPU_FRGRP_FRG2RP                               (0x00000004UL)
#define MPU_FRGRP_FRG3RP_POS                           (3U)
#define MPU_FRGRP_FRG3RP                               (0x00000008UL)
#define MPU_FRGRP_FRG4RP_POS                           (4U)
#define MPU_FRGRP_FRG4RP                               (0x00000010UL)
#define MPU_FRGRP_FRG5RP_POS                           (5U)
#define MPU_FRGRP_FRG5RP                               (0x00000020UL)
#define MPU_FRGRP_FRG6RP_POS                           (6U)
#define MPU_FRGRP_FRG6RP                               (0x00000040UL)
#define MPU_FRGRP_FRG7RP_POS                           (7U)
#define MPU_FRGRP_FRG7RP                               (0x00000080UL)

/*  Bit definition for MPU_FCR register  */
#define MPU_FCR_FMPUBRP_POS                            (0U)
#define MPU_FCR_FMPUBRP                                (0x00000001UL)
#define MPU_FCR_FMPUBWP_POS                            (1U)
#define MPU_FCR_FMPUBWP                                (0x00000002UL)
#define MPU_FCR_FMPUACT_POS                            (2U)
#define MPU_FCR_FMPUACT                                (0x0000000CUL)
#define MPU_FCR_FMPUACT_0                              (0x00000004UL)
#define MPU_FCR_FMPUACT_1                              (0x00000008UL)
#define MPU_FCR_FMPUE_POS                              (7U)
#define MPU_FCR_FMPUE                                  (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral OTS
*******************************************************************************/
/*  Bit definition for OTS_PDR register  */
#define OTS_PDR_TSPD1_POS                              (0U)
#define OTS_PDR_TSPD1                                  (0x0000FFFFUL)
#define OTS_PDR_TSPD2_POS                              (16U)
#define OTS_PDR_TSPD2                                  (0xFFFF0000UL)

/*  Bit definition for OTS_CTL register  */
#define OTS_CTL_OTSST_POS                              (0U)
#define OTS_CTL_OTSST                                  (0x0001U)
#define OTS_CTL_OTSCK_POS                              (1U)
#define OTS_CTL_OTSCK                                  (0x0002U)
#define OTS_CTL_OTSIE_POS                              (2U)
#define OTS_CTL_OTSIE                                  (0x0004U)
#define OTS_CTL_TSSTP_POS                              (3U)
#define OTS_CTL_TSSTP                                  (0x0008U)

/*  Bit definition for OTS_DR register  */
#define OTS_DR                                         (0xFFFFU)

/*  Bit definition for OTS_ECR register  */
#define OTS_ECR                                        (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_USB_SYCTLREG register  */
#define PERIC_USB_SYCTLREG_USBFS_DFB_POS               (0U)
#define PERIC_USB_SYCTLREG_USBFS_DFB                   (0x00000001UL)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN_POS             (1U)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN                 (0x00000002UL)
#define PERIC_USB_SYCTLREG_USBFS_WKUP_POS              (2U)
#define PERIC_USB_SYCTLREG_USBFS_WKUP                  (0x00000004UL)
#define PERIC_USB_SYCTLREG_USBFS_DMPD_POS              (3U)
#define PERIC_USB_SYCTLREG_USBFS_DMPD                  (0x00000008UL)
#define PERIC_USB_SYCTLREG_USBFS_DPPD_POS              (4U)
#define PERIC_USB_SYCTLREG_USBFS_DPPD                  (0x00000010UL)
#define PERIC_USB_SYCTLREG_USBFS_PDEN_POS              (5U)
#define PERIC_USB_SYCTLREG_USBFS_PDEN                  (0x00000020UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_POS               (16U)
#define PERIC_USB_SYCTLREG_USBFS_NFS                   (0x00030000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_0                 (0x00010000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_1                 (0x00020000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFE_POS               (18U)
#define PERIC_USB_SYCTLREG_USBFS_NFE                   (0x00040000UL)

/*  Bit definition for PERIC_SMC_ENAR register  */
#define PERIC_SMC_ENAR_SMCEN_POS                       (1U)
#define PERIC_SMC_ENAR_SMCEN                           (0x00000002UL)

/*  Bit definition for PERIC_CAN_SYCTLREG register  */
#define PERIC_CAN_SYCTLREG_CAN1FDE_POS                 (0U)
#define PERIC_CAN_SYCTLREG_CAN1FDE                     (0x00000001UL)
#define PERIC_CAN_SYCTLREG_CAN2FDE_POS                 (1U)
#define PERIC_CAN_SYCTLREG_CAN2FDE                     (0x00000002UL)
#define PERIC_CAN_SYCTLREG_CAN3FDE_POS                 (2U)
#define PERIC_CAN_SYCTLREG_CAN3FDE                     (0x00000004UL)
#define PERIC_CAN_SYCTLREG_USBFS_NFS_POS               (16U)
#define PERIC_CAN_SYCTLREG_USBFS_NFS                   (0x00030000UL)
#define PERIC_CAN_SYCTLREG_USBFS_NFS_0                 (0x00010000UL)
#define PERIC_CAN_SYCTLREG_USBFS_NFS_1                 (0x00020000UL)
#define PERIC_CAN_SYCTLREG_USBFS_NFE_POS               (18U)
#define PERIC_CAN_SYCTLREG_USBFS_NFE                   (0x00040000UL)

/*  Bit definition for PERIC_USART1_NFC register  */
#define PERIC_USART1_NFC_USASRT1_NFS_POS               (0U)
#define PERIC_USART1_NFC_USASRT1_NFS                   (0x00000003UL)
#define PERIC_USART1_NFC_USASRT1_NFS_0                 (0x00000001UL)
#define PERIC_USART1_NFC_USASRT1_NFS_1                 (0x00000002UL)
#define PERIC_USART1_NFC_USART1_NFE_POS                (2U)
#define PERIC_USART1_NFC_USART1_NFE                    (0x00000004UL)

